In [3]:
import pandas as pd

In [5]:
data={"name":["kazim","umer","ali","ahmed","atif","tayyab","kashif","asad","tariq","qamar"],
      "last_name":["khan","tanveer","amjd","umer","safeer","asad","tariq","kashif","hatim","john"],
      "age":[20,22,23,23,24,25,26,30,31,32],
      "department":["cs","se","ds","it","bba","d_form","bs_maths","law","english","stats"]}

In [7]:
df=pd.DataFrame(data)

In [9]:
df.head()

    name last_name  age department
0  kazim      khan   20         cs
1   umer   tanveer   22         se
2    ali      amjd   23         ds
3  ahmed      umer   23         it
4   atif    safeer   24        bba

In [10]:
df.head(10)

     name last_name  age department
0   kazim      khan   20         cs
1    umer   tanveer   22         se
2     ali      amjd   23         ds
3   ahmed      umer   23         it
4    atif    safeer   24        bba
5  tayyab      asad   25     d_form
6  kashif     tariq   26   bs_maths
7    asad    kashif   30        law
8   tariq     hatim   31    english
9   qamar      john   32      stats

In [13]:
df["name"].str.upper()

0     KAZIM
1      UMER
2       ALI
3     AHMED
4      ATIF
5    TAYYAB
6    KASHIF
7      ASAD
8     TARIQ
9     QAMAR
Name: name, dtype: object

In [15]:
df["name"].str.capitalize()

0     Kazim
1      Umer
2       Ali
3     Ahmed
4      Atif
5    Tayyab
6    Kashif
7      Asad
8     Tariq
9     Qamar
Name: name, dtype: object

In [16]:
df["department"].str.capitalize()

0          Cs
1          Se
2          Ds
3          It
4         Bba
5      D_form
6    Bs_maths
7         Law
8     English
9       Stats
Name: department, dtype: object

In [19]:
df["department"].str.upper()

0          CS
1          SE
2          DS
3          IT
4         BBA
5      D_FORM
6    BS_MATHS
7         LAW
8     ENGLISH
9       STATS
Name: department, dtype: object

In [50]:
df.iloc[2:6,1:-1]

  last_name  age department
c      amjd   23         ds
d      umer   23         it
e    safeer   24        bba
f      asad   25     d_form

In [22]:
df.iloc[[2,6],[1,3]]

  last_name department
2      amjd         ds
6     tariq   bs_maths

In [25]:
df.iloc[[1,-1],[1,2]]

  last_name  age
1   tanveer   22
9      john   32

In [27]:
df["full_name"]=df["name"]+df["last_name"]

In [29]:
df.head()

    name last_name  age department    full_name
0  kazim      khan   20         cs    kazimkhan
1   umer   tanveer   22         se  umertanveer
2    ali      amjd   23         ds      aliamjd
3  ahmed      umer   23         it    ahmedumer
4   atif    safeer   24        bba   atifsafeer

In [31]:
df["full_name"]=df["name"]+" "+df["last_name"]

In [33]:
df.head()

    name last_name  age department     full_name
0  kazim      khan   20         cs    kazim khan
1   umer   tanveer   22         se  umer tanveer
2    ali      amjd   23         ds      ali amjd
3  ahmed      umer   23         it    ahmed umer
4   atif    safeer   24        bba   atif safeer

In [35]:
df["full_name"]=df["name"].str.capitalize()+" "+df["last_name"].str.capitalize()

In [37]:
df.head()

    name last_name  age department     full_name
0  kazim      khan   20         cs    Kazim Khan
1   umer   tanveer   22         se  Umer Tanveer
2    ali      amjd   23         ds      Ali Amjd
3  ahmed      umer   23         it    Ahmed Umer
4   atif    safeer   24        bba   Atif Safeer

In [39]:
data={"name":["kazim","umer","ali","ahmed","atif","tayyab","kashif","asad","tariq","qamar"],
      "last_name":["khan","tanveer","amjd","umer","safeer","asad","tariq","kashif","hatim","john"],
      "age":[20,22,23,23,24,25,26,30,31,32],
      "department":["cs","se","ds","it","bba","d_form","bs_maths","law","english","stats"]}
row=["a","b","c","d","e","f","i","k","s","l"]
df.index=row
print(df)

     name last_name  age department     full_name
a   kazim      khan   20         cs    Kazim Khan
b    umer   tanveer   22         se  Umer Tanveer
c     ali      amjd   23         ds      Ali Amjd
d   ahmed      umer   23         it    Ahmed Umer
e    atif    safeer   24        bba   Atif Safeer
f  tayyab      asad   25     d_form   Tayyab Asad
i  kashif     tariq   26   bs_maths  Kashif Tariq
k    asad    kashif   30        law   Asad Kashif
s   tariq     hatim   31    english   Tariq Hatim
l   qamar      john   32      stats    Qamar John

In [41]:
df.loc["e","age"]

24

In [43]:
df.loc["i","full_name"]

'Kashif Tariq'

In [45]:
print("enfffjsd")

enfffjsd